[
  {
    "name": "Terrace View Apartments",
    "rating": 5,
    "address": "413 Hunt Club Rd, Blacksburg, VA 24060",
    "image": "example.png",
    "beds": 1,
    "bathroom": 1,
    "price": 850,
    "about": "Terrace View Apartments luxury apartments for rent in Blacksburg, VA offers 1, 2, 3 and 4 bedroom apartments and townhomes for rent. At Terrace View Apartments, we focus on what's really important - YOU! Living here, you'll be less than 1 mile from Virginia Tech, have access to 14 bus stops and a bike lane to campus, close to local hot spots, shopping, Route 460, and more! You can choose from a variety of floor plans to suit your personal style. Townhomes and Garden Apartments are available in many sizes, with a multitude of options. You will discover what student living really is at Terrace View! Please call us today for an appointment! We are now offering 3 levels of floor plans to better cater to your needs! Please see below for a description to help determine the best option for you: The Addison- (Renovated/furnished) Stainless steel appliances, upgraded cabinets, hard surface (quartz or granite), white subway tile backsplash, upgraded hardware, lighting and plumbing. The flooring is partially or all: vinyl luxury plank, carpet, or concrete. Bathrooms are full or partial renovated. The Blacksburg- (Partial renovated/furnished) black appliances, grey cabinets, black/ granite tile counters. The flooring may be partially or all: vinyl luxury plank, carpet, or concrete. Some bathrooms are updated. The Caldwell- (Classic unrenovated unit/unfurnished) carpet flooring, almond/white/black appliances, original wood and/or red cabinets, Formica countertops. The flooring may be partially or all: sheet vinyl, carpet, or concrete. Original classic bathrooms.",
    "special_features": [
      "$250 Referral Special",
      "50 In Tv Included",
      "Air Conditioner",
      "Cable",
      "Ceiling Fan",
      "Classic Non Renovated Townhouse"
    ],
    "community_features": [
      "Laundry Facilities",
      "Maintenance on site",
      "Furnished Units Available",
      "Recycling",
      "Renters Insurance Program"
    ],
    "pet_policy": "Dogs and Cats Allowed",
    "reviews": []
  },
  {
    "name": "The Retreat at Blacksburg Apartments",
    "rating": 5,
    "address": "1800 Redd Rd, Blacksburg, VA 24060",
    "image": "example.png",
    "beds": 2,
    "bathroom": 2,
    "price": 955,
    "about": "The Retreat at Blacksburg is the most talked about cottage community serving the student community at Virginia Polytechnic Institute and State University in Blacksburg, VA. The Retreat residents enjoy an all-inclusive study and play community featuring an indoor golf simulator, a computer lab and study rooms, expansive green space, and the pool with the best view in Blacksburg! Make the Retreat at Blacksburg your new home away from home today! We're the ultimate package in off-campus living for you and your friends.",
    "special_features": ["Valet Trash Service"],
    "community_features": [
      "Community-Wide WiFi",
      "Wi-Fi",
      "Maintenance on site",
      "24 Hour Access",
      "Furnished Units Available"
    ],
    "pet_policy": "Dogs Allowed",
    "reviews": []
  }
]
